---
type: PolylineSegments
namespace: Autodesk.Revit.DB
version: 2024
members: 9
tags: [revit-api, class]
---

# PolylineSegments

`Autodesk.Revit.DB.PolylineSegments` · Revit 2024 · 9 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Dispose | — | `public void Dispose ()` |
| Method | GetVertices | 2016 | `public IList < XYZ > GetVertices ()` |
| Property | EndLocalParameter | 2016 | `public double EndLocalParameter { get ; }` |
| Property | EndParameter | 2016 | `public double EndParameter { get ; }` |
| Property | IsFilled | 2016 | `public bool IsFilled { get ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | LineProperties | 2016 | `public LineProperties LineProperties { get ; }` |
| Property | StartLocalParameter | 2016 | `public double StartLocalParameter { get ; }` |
| Property | StartParameter | 2016 | `public double StartParameter { get ; }` |